posts/windowsc-doors-or-homes.org
#+BEGIN_COMMENT
.. title: Windows©, Doors or Homes!??!
.. date: 2007-04-01 19:14:00
.. tags: blog, ology, rms, song
.. slug: windowsc-doors-or-homes
#+END_COMMENT




A couple of days back.. one guy called green_mamba asked me.. "Why
do you use Linux (GNU/Linux) and not Windows? What is it that
makes LinuxGNU/Linux] so special for you?" I avoided that
question then.. {I was in no mood of answering questions... Exams
had finished just the day before!!}  I am trying to answer it
now... green_mamba also told me that Roopesh said, "I use it
because I can look at the source code. I am allowed to look at how
things work and fiddle with the way they work!"... I knew it
immediately that this was not the reason for me.[I rarely looked
at source code... and making changes to it.. haha..] So what is
it? I think I can answer this question if I get back to the time
when I started using Linux...[hehe.. not too long ago!! :P]

So how did I start using GNU/Linux? How did "we" first meet? It
was during last summer holidays.. that Voods sent me this link
... [I had definitely used GNU/Linux on a few occasions
before... but.. this was when I really began using it...] and
within hours I was a fan of GNU/Linux!![and Richard M Stallman
(RMS)]

So its the "philosophy"... The philosophy of Free
Software... [Free as in Freedom, not as in Free Beer...(English is
a wierd wierd Language...)]... The philosophy of Open
Source... that brought me to it... This song says it the best...

#+begin_verse
Free Software Song --RMS

Join us now and share the software;
You'll be free, hackers, you'll be free.

Join us now and share the software;
You'll be free, hackers, you'll be free.

Hoarders may get piles of money,
That is true, hackers, that is true.
But they cannot help their neighbors;
That's not good, hackers, that's not good.

When we have enough free software
At our call, hackers, at our call,
We'll throw out those dirty licenses
Ever more, hackers, ever more.

Join us now and share the software;
You'll be free, hackers, you'll be free.

Join us now and share the software;
You'll be free, hackers, you'll be free.
#+end_verse

now I continue to use it.. for a variety of reasons..[they are NOT
in the order of their priority/importance]

- Firstly, using Linux gives me a sense of community... a sense of
  oneness [this can't happen with Windows.. because you can't
  share stuff... :-(]
- I have begun to hate the concept of Proprietary Software... can
  you believe that.. "Sharing stuff..  makes us PIRATES!!"

- I am a growing fan of the Command Line... It simply rocks!!

- There's almost no problem of Viruses/Malware.. You simply don't
  need an Anti-Virus..(that needs to be updated every night.. or
  u'll have nightmares...)

- Then there's this wonderful concept of Live-CDs.. {specially
  Knoppix.. Its absolutely awesome!} It put me(us?) out of
  soup... a lotta times...

- The fiddle factor... I have just started to fiddle with
  things(...source codes... I added a small feature to my
  dc-client Microdc2].. the feature of away messages.. it feels
  gr8! :P)

- One of my best friend is using it too! [you know who...]

- The Mascot looks cool!! ;) [I liked the GNU mascot too! (It's on
  my side-bar) ]

- The name "LINUX"!! [There's so many flavors(Distros) of
  Linux.. that I can keep trying different ones.. all my
  life :P.. presently with Slackware!]

- Its Fun!! and I want to use it...

- and finally... Windows sucks! [I don't have to use it... :P]!!

Value your freedom or you will lose it, teaches history. "Don't
bother us with politics," respond those who don't want to learn.
--Richard Stallman

When you say, "I wrote a program that crashed Windows", people
just stare at you blankly and say, "Hey, I got those with the
system, for free".  --Linus Torvalds

"What happens when you read some doc and either it doesn't answer
 your question or is demonstrably wrong? In Linux, you say "Linux
 sucks" and go read the code. In Windows/Oracle/etc you say
 "Windows sucks" and start banging your head against the wall."
 --- Denis Vlasenko on linux kernel mailing list

"The box said that I needed to have Windows 98 or better... so I
installed Linux."  -- LinuxNewbie.org
