output/posts/windowsc-doors-or-homes.html
<!DOCTYPE html><html lang="en">
<head>
    
    <meta charset="utf-8">
    <meta name="description" content="">
    <meta name="author" content="punchagan">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Windows©, Doors or Homes!??! | Noetic Nought</title>
    
            <link href="/assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
    <!--[if lt IE 9]>
    <![endif]-->
            <link rel="alternate" type="application/rss+xml" title="RSS" href="/rss.xml">

    



    
</head>

<body>
    <section class="social">
        <ul>
<!--        <h1 id="blog-title">
            <a href="/" title="Noetic Nought">Noetic Nought</a>
        </h1>
        
         -->
        
            <li><a href="/index.html" title="Home"><i class="icon-home"></i></a></li>
            <li><a href="/archive.html" title="Archives"><i class="icon-folder-open-alt"></i></a></li>
            <li><a href="/categories/index.html" title="Tags"><i class="icon-tags"></i></a></li>
            <li><a href="/rss.xml" title="RSS"><i class="icon-rss"></i></a></li>
            <li><a href="https://twitter.com/punchagan" title="Twitter profile"><i class="icon-twitter"></i></a></li>
            <li><a href="https://github.com/punchagan" title="GitHub profile"><i class="icon-github"></i></a></li>

<!--         -->
        </ul>
    </section>
    <section class="page-content">
        <div class="content" rel="main">
            
    <div class="post">
    
    <h1 class="p-name" itemprop="headline name">Windows©, Doors or Homes!??!</h1>

        <div class="meta">
            <div class="authordate">
                <time class="timeago" datetime="2007-04-01T19:14:00+05:30">2007-04-01 19:14</time>
            </div>
            

            
          |  
        <a href="/posts/windowsc-doors-or-homes.org" id="sourcelink">Source</a>

            
    <div class="tags">
        <ul>
        More posts about:  
            <li><a class="tag" href="/categories/blog.html">blog</a></li>
            <li><a class="tag" href="/categories/ology.html">ology</a></li>
            <li><a class="tag" href="/categories/rms.html">rms</a></li>
            <li><a class="tag" href="/categories/song.html">song</a></li>
        </ul>
    </div>

        </div>
        <div class="body">
            <p>
A couple of days back.. one guy called green<sub>mamba</sub> asked me.. "Why
do you use Linux (GNU/Linux) and not Windows? What is it that
makes LinuxGNU/Linux] so special for you?" I avoided that
question then.. {I was in no mood of answering questions… Exams
had finished just the day before!!}  I am trying to answer it
now… green<sub>mamba</sub> also told me that Roopesh said, "I use it
because I can look at the source code. I am allowed to look at how
things work and fiddle with the way they work!"… I knew it
immediately that this was not the reason for me.[I rarely looked
at source code… and making changes to it.. haha..] So what is
it? I think I can answer this question if I get back to the time
when I started using Linux…[hehe.. not too long ago!! :P]
</p>

<p>
So how did I start using GNU/Linux? How did "we" first meet? It
was during last summer holidays.. that Voods sent me this link
… [I had definitely used GNU/Linux on a few occasions
before… but.. this was when I really began using it…] and
within hours I was a fan of GNU/Linux!![and Richard M Stallman
(RMS)]
</p>

<p>
So its the "philosophy"… The philosophy of Free
Software… [Free as in Freedom, not as in Free Beer…(English is
a wierd wierd Language…)]… The philosophy of Open
Source… that brought me to it… This song says it the best…
</p>

<p class="verse">
Free Software Song –RMS<br>
<br>
Join us now and share the software;<br>
You'll be free, hackers, you'll be free.<br>
<br>
Join us now and share the software;<br>
You'll be free, hackers, you'll be free.<br>
<br>
Hoarders may get piles of money,<br>
That is true, hackers, that is true.<br>
But they cannot help their neighbors;<br>
That's not good, hackers, that's not good.<br>
<br>
When we have enough free software<br>
At our call, hackers, at our call,<br>
We'll throw out those dirty licenses<br>
Ever more, hackers, ever more.<br>
<br>
Join us now and share the software;<br>
You'll be free, hackers, you'll be free.<br>
<br>
Join us now and share the software;<br>
You'll be free, hackers, you'll be free.<br>
</p>

<p>
now I continue to use it.. for a variety of reasons..[they are NOT
in the order of their priority/importance]
</p>

<ul class="org-ul">
<li>Firstly, using Linux gives me a sense of community… a sense of
oneness [this can't happen with Windows.. because you can't
share stuff… :-(]
</li>
<li>I have begun to hate the concept of Proprietary Software… can
you believe that.. "Sharing stuff..  makes us PIRATES!!"
</li>

<li>I am a growing fan of the Command Line… It simply rocks!!
</li>

<li>There's almost no problem of Viruses/Malware.. You simply don't
need an Anti-Virus..(that needs to be updated every night.. or
u'll have nightmares…)
</li>

<li>Then there's this wonderful concept of Live-CDs.. {specially
Knoppix.. Its absolutely awesome!} It put me(us?) out of
soup… a lotta times…
</li>

<li>The fiddle factor… I have just started to fiddle with
things(…source codes… I added a small feature to my
dc-client Microdc2].. the feature of away messages.. it feels
gr8! :P)
</li>

<li>One of my best friend is using it too! [you know who…]
</li>

<li>The Mascot looks cool!! ;) [I liked the GNU mascot too! (It's on
my side-bar) ]
</li>

<li>The name "LINUX"!! [There's so many flavors(Distros) of
Linux.. that I can keep trying different ones.. all my
life :P.. presently with Slackware!]
</li>

<li>Its Fun!! and I want to use it…
</li>

<li>and finally… Windows sucks! [I don't have to use it… :P]!!
</li>
</ul>

<p>
Value your freedom or you will lose it, teaches history. "Don't
bother us with politics," respond those who don't want to learn.
–Richard Stallman
</p>

<p>
When you say, "I wrote a program that crashed Windows", people
just stare at you blankly and say, "Hey, I got those with the
system, for free".  –Linus Torvalds
</p>

<p>
"What happens when you read some doc and either it doesn't answer
 your question or is demonstrably wrong? In Linux, you say "Linux
 sucks" and go read the code. In Windows/Oracle/etc you say
 "Windows sucks" and start banging your head against the wall."
 — Denis Vlasenko on linux kernel mailing list
</p>

<p>
"The box said that I needed to have Windows 98 or better… so I
installed Linux."  – LinuxNewbie.org
</p>
        </div>
        
    <ul class="pager">
        <li class="previous">
            <a href="/posts/andharu-mahanubhavule-andariki-vandanamulu.html" rel="prev">← Previous post</a>
        </li>
        <li class="next">
            <a href="/posts/a-second-blog.html" rel="next">Next post →</a>
        </li>
    </ul>

            
        
        <div id="disqus_thread"></div>
        <script>
        var disqus_shortname ="rusticreverie",
            disqus_url="http://punchagan.muse-amuse.in/posts/windowsc-doors-or-homes.html",
        disqus_title="Windows\u00a9, Doors or Homes!??!",
        disqus_identifier="cache/posts/windowsc-doors-or-homes.html",
        disqus_config = function () {
            this.language = "en";
        };
        (function() {
            var dsq = document.createElement('script'); dsq.async = true;
            dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
            (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
        })();
    </script>
    <noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript" rel="nofollow">comments powered by Disqus.</a></noscript>
    <a href="http://disqus.com" class="dsq-brlink" rel="nofollow">Comments powered by <span class="logo-disqus">Disqus</span></a>


        

    </div>

            © 2013
<a href="mailto:punchagan%5B@T%5Dmuse-amuse.in">punchagan</a> -
<a href="http://getnikola.com">Nikola</a> powered -

<a rel="license" href="http://creativecommons.org/licenses/by/3.0/deed.en_US">
Creative Commons Attribution 3.0 Unported License</a>
 -
<a href="http://themes.getnikola.com/#zen">zen</a> theme
            
	

        </div>
    </section>
    
            <script src="/assets/js/all-nocdn.js" type="text/javascript"></script>

    
        <script type="text/javascript">
            $(function(){
                $('.timeago').timeago();
            });
        </script>
    
    <script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-21111013-1']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script>

</body>
</html>